//task 1
//Определите переменные str, num, flag и txt со значениями «Привет», 123, true, «true».
// При помощи оператора typeof убедитесь, что значения переменных принадлежат типам: string, number и  boolean.
//**********************************************************************************************************************

let str = 'Привет',
    num = 123,
    flag = true,
    txt = 'true';

console.log(typeof str);   //string
console.log(typeof num);   //number
console.log(typeof flag);  //boolean
console.log(typeof txt);   //string

//task 2
//Создайте переменные a1, a2, a3, a4, a5. При помощи математических операторов (сложение, вычитание и т.д.) найдите значения выражений:
//**********************************************************************************************************************

let a1, a2, a3, a4, a5;

a1 = 5 + 3;  //8
a2 = 5 - 3;  //2
a3 = 5 * 3;  //15
a4 = 5 / 3;  //1.6666666667
a5 = 5 % 3;  //2

console.log(a1, a2, a3, a4, a5);

//task 3
//Создайте переменные a6, a7, a8, a9, a10. Поместите в них результат выражений:
//**********************************************************************************************************************

let a6, a7, a8, a9, a10;
a6 =  5 % 3;      //2
a7 = 3 % 5;       //3
a8 = 5 + '3';     //'53'
a9 = '5' - 3;     //2
a10 = 75 + 'кг';  //'75кг'

console.log(a6, a7, a8, a9, a10);

//task 4
//Напишите код, который находит площадь прямоугольника высота 23см. ( переменная height),
//шириной 10см (переменная width), значение площади должно хранится в числовой переменной s.
//**********************************************************************************************************************

let height = 23, width = 10;
let s = height * width;

console.log(s);  //230cm

//task 5
// Напиши код, который находит объем цилиндра высотой 10м (переменная heightC) и диаметром основания 4м (dC),
// результат поместите в переменную v.
//**********************************************************************************************************************

let heightC = 10, dC = 4;
let v = Math.PI * dC * dC * heightC / 4;

console.log(v) //125.663706...

//task 6
// У прямоугольного треугольника две стороны n (со значением 3) и m (со значением 4).
// Найдите гипотенузу k по теореме Пифагора (нужно использовать функцию Math.pow(число, степень) или оператор возведения в степень ** ).
//**********************************************************************************************************************

let n = 3, m = 4;
let k = Math.sqrt(n ** 2 + Math.pow(m, 2));

console.log(k);

//task 7
//Напишите скрипт, который выводит "Hello world", создавши переменную str и выводить спомощью document.write, alert и console.log
//**********************************************************************************************************************

str = 'Hello world';

console.log(str);
alert(str);
document.write(str, '<br/>');

//task 8
//Вывести в окно браузера при помощи метода alert() следующие данные: Ваше ФИО, возраст, хобби (каждой на новой строки спомощью \n)
//**********************************************************************************************************************

alert('Слюсаренко Андрій Сергійович\n18 років\nПлавання')

//task 9
//Создать 4 переменные с использованием ключевого слова let с именами str1, str2, str3, concatenation.
//Переменной str1 присвоить фразу ‘Кто ‘, str2 – ‘ты ‘, str3 – ‘такой?’
//Локальной переменной concatenation присвоить результат конкатенации 3-х строк: str1, str2, str3.
//Вывести в документ содержимое переменной concatenation спомощью document.write
//**********************************************************************************************************************

let str1, str2, str3, concatenation;
str1 = 'Кто ';
str2 = 'ты ';
str3 = 'такой?';
concatenation = str1 + str2 + str3;

document.write(concatenation, '<br/>');

//task 10
// Какие значения выведет в окно браузера следующий фрагмент кода?  и почему?
//     let str = "20";
//     let a = 5;
//     document.write(str + a + "<br/>");
//     document.write(str - a + "<br/>");
//     document.write(str * "2" + "<br/>");
//     document.write(str / 2 + "<br/>");
//**********************************************************************************************************************

str = "20";
let a = 5;

document.write(str + a + "<br/>");    //205
document.write(str - a + "<br/>");    //15
document.write(str * "2" + "<br/>");  //40
document.write(str / 2 + "<br/>");    //10

//task 11
//Какие значения выведет в окно консоли следующий фрагмент кода если его поместить в console.log?
//     parseInt("3.14")
//     parseInt("-7.875")
//     parseInt("435")
//     parseInt("Вася")
//**********************************************************************************************************************

console.log(parseInt("3.14"));     //3
console.log(parseInt("-7.875"));   //-7
console.log(parseInt("435"));      //435
console.log(parseInt("Вася"));     //NaN

//task 12
// С помощью окна ввода, вызываемого методом prompt, пользователь может ввести данные, которые будут использоваться далее, повторите код ниже
//     let str = prompt("Enter something", "ho-ho")
//     console.log(str);
//**********************************************************************************************************************

str = prompt("Enter something", "ho-ho");
console.log(str);

//task 13
// С помощью окна ввода, вызываемого методом prompt, сделать сложение двух чисел, а вывод результата при помощи метода alert
//**********************************************************************************************************************

let s1 = +prompt('To calculate the amount\nEnter first number', 3);
let s2 = +prompt('To calculate the amount\nEnter second number', 4);
let sum = s1 + s2;

alert('Result:\n' + sum);

//task 14
//С помощью окна ввода, вызываемого методом prompt, пользователь последовательно выводит имя, фамилию и возраст, а вам не обходимо вывести строку такого вида
//Доброго вечера Иван Иванов, мои поздравления что вам 32, а вывод результата при помощи метода alert
//**********************************************************************************************************************

let name = prompt('Введите имя');
let surname = prompt('Введите фамилию');
let age = prompt('Введите свой возраст');

alert('Доброго вечера ' + name + ' ' + surname + ', мои поздравления что вам ' + age)
